const buddy = {
  box: {
    start: '20',
    step: 8
  },
  type: {
    '20': '艾露猫',
    '28': '牙猎犬'
  },
  level: {
    '059C31': 50,
    '059C30': 49
  },
  skill: {
    '01': '体力強化の術【小】',
    '02': '体力強化の術【大】',
    '03': '攻撃強化の術【小】',
    '04': '攻撃強化の術【大】',
    '05': '遠隔攻撃強化の術',
    '06': '防御強化の術',
    '07': '全耐性強化の術',
    '08': '会心強化の術【小】',
    '09': '会心強化の術【大】',
    '0A': '属性攻撃強化の術',
    '0B': '状態異常攻撃強化の術',
    '0C': 'KOの術',
    '0D': '回避上手の術',
    '0E': '自己回復強化の術',
    '0F': '毒無効の術',
    '10': '風圧無効の術',
    '11': '麻痺無効の術',
    '12': '気絶無効の術',
    '13': '耐震の術',
    '14': '防音の術',
    '15': '睡眠無効の術',
    '16': '爆破・鬼火無効の術',
    '17': '糸拘束無効の術'
  },
  move: {
    '01': '癒しの果実栽培の技',
    '02': 'ネコ式鉄蟲糸縛りの技',
    '03': 'ネコ式起爆爆弾の技',
    '04': '強化咆哮の技',
    '05': '環境生物発射の術',
    '06': '回復笛の技',
    '07': '回復しゃぼんの技',
    '08': 'ネコ式活力壺の技',
    '09': 'キンダンドングリの技',
    '0A': '毒々落とし穴の技',
    '0B': '環境生物呼び寄せの技',
    '0C': 'シビレ罠の技',
    '0D': '応援ダンスの技',
    '0E': '特大タル爆弾の技',
    '0F': '閃光爆弾の技',
    '10': '設置型爆弾の技',
    '11': 'バチバチ爆弾ゴマの技',
    '12': '憤怒の技',
    '13': '強化太鼓の技',
    '14': '変わり身の技',
    '15': '竜巻旋風撃の技',
    '16': 'ぶんどりの技',
    '17': '電転虫発射の技',
    '18': 'メガブーメランの技',
    '19': '隠密防御の技'
  }
}

export default buddy
