const stats = {
  quest: {
    'A0': '村庄任务',
    'A4': '集会所下位任务',
    'A8': '集会所上位任务',
    'AC': '百龙夜行',
    'B0': '斗技大会任务',
    'B4': '集会所大师等级任务',
    'B8': '盟友任务：重要调查任务',
    'BC': '盟友任务：盟友同行任务',
    'C0': '怪异任务：★1～4'
  },
  weaponList: [
    {
      name: '大剑',
      id: '20'
    },
    {
      name: '太刀',
      id: '28'
    },
    {
      name: '单手剣',
      id: '40'
    },
    {
      name: '双剑',
      id: '44'
    },
    {
      name: '大锤',
      id: '34'
    },
    {
      name: '狩猎笛',
      id: '48'
    },
    {
      name: '长枪',
      id: '3C'
    },
    {
      name: '铳枪',
      id: '38'
    },
    {
      name: '斩击斧',
      id: '24'
    },
    {
      name: '盾斧',
      id: '4C'
    },
    {
      name: '操虫棍',
      id: '50'
    },
    {
      name: '轻弩炮',
      id: '2C'
    },
    {
      name: '重弩炮',
      id: '30'
    },
    {
      name: '弓',
      id: '54'
    }
  ],
  weaponQuest: {
    '0180': '综合',
    '0188': '村庄任务',
    '0190': '集会所任务',
    '0198': '百龙夜行',
    '01B0': '集会所大师等级任务',
    '01A0': '盟友任务：重要调查任务',
    '01A8': '盟友任务：盟友同行任务',
    '01B8': '怪异任务：★1～4'
  },
  rankExp: {
    '1-8': 0,
    '9-16': 400,
    '17-21': 500,
    '22-31': 620,
    '32-41': 760,
    '42-51': 860,
    '52-101': 980,
    '102-151': 1330,
    '152-201': 1680,
    '202-251': 2030,
    '252-301': 2380,
    '302-351': 2730,
    '352-401': 3080,
    '402-451': 3430,
    '452-501': 3780,
    '502-551': 4180,
    '552-601': 4580,
    '602-651': 4980,
    '652-701': 5380,
    '702-751': 5780,
    '752-801': 6180,
    '802-851': 6580,
    '852-901': 6980,
    '902-951': 7380,
    '952-999': 7780
  }
}

export default stats
