const usage = {
  weaponList: [
    {
      name: '大剑',
      id: '20'
    },
    {
      name: '太刀',
      id: '28'
    },
    {
      name: '单手剣',
      id: '40'
    },
    {
      name: '双剑',
      id: '44'
    },
    {
      name: '大锤',
      id: '34'
    },
    {
      name: '狩猎笛',
      id: '48'
    },
    {
      name: '长枪',
      id: '3C'
    },
    {
      name: '铳枪',
      id: '38'
    },
    {
      name: '斩击斧',
      id: '24'
    },
    {
      name: '盾斧',
      id: '4C'
    },
    {
      name: '操虫棍',
      id: '50'
    },
    {
      name: '轻弩炮',
      id: '2C'
    },
    {
      name: '重弩炮',
      id: '30'
    },
    {
      name: '弓',
      id: '54'
    }
  ],
  weaponQuest: {
    '0180': '综合',
    '0188': '村庄任务',
    '0190': '集会所任务',
    '0198': '百龙夜行',
    '01B0': '集会所大师等级任务',
    '01A0': '盟友任务：重要调查任务',
    '01A8': '盟友任务：盟友同行任务',
    '01B8': '怪异任务：★1～4'
  }
}

export default usage
